{
  "users": [
    {
      "id": "1",
      "email": "jean.dupont@example.com",
      "name": "Jean Luc",
      "password": "pass1234",
      "age": 25,
      "sexe": "M",
      "profilePictureUrl": "https://images.unsplash.com/photo-1544723795-3fb6469f5b39"
    },
    {
      "id": "2",
      "email": "alice.martin@example.com",
      "name": "Alice Martin",
      "password": "pass1234",
      "age": 23,
      "sexe": "F",
      "profilePictureUrl": "https://images.unsplash.com/photo-1506748686214e9df14a4d4d7d9a621d1a6a67d6e1e3"
    },
    {
      "id": "3",
      "email": "lucas.bernard@example.com",
      "name": "Lucas Bernard",
      "password": "pass1234",
      "age": 24,
      "sexe": "M",
      "profilePictureUrl": "https://images.unsplash.com/photo-1502720705746-3a3829e8d3e0"
    },
    {
      "id": "a3af",
      "email": "pav@gmail.com",
      "password": "1234",
      "age": 15,
      "sexe": "F",
      "profilePictureUrl": "ggg"
    },
    {
      "id": "797d",
      "email": "dou@gmail.com",
      "name": "Dou",
      "password": "12345",
      "age": 15,
      "sexe": "M",
      "profilePictureUrl": "sss"
    },
    {
      "id": "8a04",
      "email": "toto@gmail.com",
      "name": "Toto",
      "password": "123456",
      "age": 24,
      "sexe": "M",
      "profilePictureUrl": "rrr"
    },
    {
      "id": "c632",
      "email": "tata@gmal.cm",
      "name": "tat",
      "password": "123456",
      "age": 16,
      "sexe": "M",
      "profilePictureUrl": "ppp"
    },
    {
      "id": "ae7c",
      "email": "dio@gmail.com",
      "name": "dio",
      "password": "abcdef",
      "age": 18,
      "sexe": "F",
      "profilePictureUrl": "fff"
    },
    {
      "id": "369d",
      "email": "Arm@gmail.com",
      "name": "Armelle",
      "password": "123456",
      "age": 20,
      "sexe": "F",
      "profilePictureUrl": "ert"
    },
    {
      "id": "1b4c",
      "email": "pavi@efrei.net",
      "name": "pavi",
      "password": "password",
      "age": 19,
      "sexe": "F",
      "profilePictureUrl": "123"
    },
    {
      "id": "8dc1",
      "email": "paul@gm.com",
      "name": "paul",
      "password": "123456",
      "age": 23,
      "sexe": "M",
      "profilePictureUrl": "aze"
    }
  ],
  "candidates": [
    {
      "id": "1",
      "name": "Jean Dupont",
      "age": 25,
      "profilePictureUrl": "https://images.unsplash.com/photo-1544723795-3fb6469f5b39",
      "bio": "Jean Dupont, étudiant en master de gestion, est profondément engagé dans la vie associative de son université. Fort de son expérience comme président du comité des étudiants, il a su gérer des équipes et organiser des événements pour améliorer la qualité de vie sur le campus. Son sens de la responsabilité et son écoute active lui ont permis de bâtir des relations solides entre les étudiants et l'administration, tout en restant à l'écoute des besoins et des idées de ses pairs. À 25 ans, Jean est reconnu pour son leadership naturel et sa capacité à rassembler les gens autour d'objectifs communs.",
      "program": "Jean souhaite renforcer la communication entre les étudiants et l'administration en mettant en place des forums ouverts et des sondages réguliers pour recueillir les avis et les préoccupations de chacun. Il propose également une réforme du système de vote en ligne pour des élections plus transparentes, sécurisées et accessibles à tous. Son programme inclut l'organisation d'événements mensuels pour favoriser le dialogue et la cohésion au sein de la communauté universitaire, ainsi que des initiatives pour encourager l'engagement des étudiants dans la prise de décision sur le campus."
    },
    {
      "id": "2",
      "name": "Alice Martin",
      "age": 23,
      "profilePictureUrl": "https://images.unsplash.com/photo-1506748686214e9df14a4d4d7d9a621d1a6a67d6e1e3",
      "bio": "Alice Martin, en deuxième année de communication, est passionnée par la gestion des projets et les événements culturels. Elle a été impliquée dans plusieurs projets de volontariat et souhaite améliorer la visibilité des événements étudiants.",
      "program": "Alice propose de créer un calendrier centralisé des événements universitaires pour éviter les conflits de planning. Elle souhaite également mettre en place un réseau de soutien pour les projets étudiants afin de mieux coordonner les ressources et les efforts."
    },
    {
      "id": "3",
      "name": "Lucas Bernard",
      "age": 24,
      "profilePictureUrl": "https://images.unsplash.com/photo-1502720705746-3a3829e8d3e0",
      "bio": "Lucas Bernard, étudiant en ingénierie, est un leader naturel avec une expérience en gestion de projet. Il est déterminé à utiliser ses compétences techniques pour améliorer la vie universitaire.",
      "program": "Lucas veut introduire des ateliers de formation pour les étudiants afin de développer des compétences techniques et professionnelles. Il prévoit également de créer une plateforme en ligne pour faciliter le partage de ressources entre étudiants."
    },
    {
      "id": "4",
      "name": "Sophie Dubois",
      "age": 22,
      "profilePictureUrl": "https://images.unsplash.com/photo-1506748686214-12e6e3b0db7f",
      "bio": "Sophie Dubois, en licence de droit, est une militante active pour les droits étudiants. Elle est connue pour son engagement dans les associations de défense des droits et des libertés.",
      "program": "Sophie souhaite mettre en place un comité pour les droits des étudiants afin de veiller à ce que leurs préoccupations soient prises en compte. Elle propose aussi des séances d'information sur les droits étudiants et la manière de les protéger."
    },
    {
      "id": "5",
      "name": "Mathieu Lefèvre",
      "age": 26,
      "profilePictureUrl": "https://images.unsplash.com/photo-1519608470507-7d282e6cb7f5",
      "bio": "Mathieu Lefèvre est un étudiant en MBA avec une solide expérience en gestion d'équipe et en organisation d'événements. Son approche analytique et sa capacité à résoudre les problèmes sont bien reconnues.",
      "program": "Mathieu veut améliorer l'efficacité des processus administratifs en introduisant des outils numériques pour simplifier les démarches des étudiants. Il propose également des sessions de formation sur la gestion du temps et des ressources."
    },
    {
      "id": "6",
      "name": "Claire Leroy",
      "age": 23,
      "profilePictureUrl": "https://images.unsplash.com/photo-1495561962092-51c059de5a6f",
      "bio": "Claire Leroy, étudiante en arts, est connue pour ses talents créatifs et son sens de l'organisation. Elle a dirigé plusieurs projets artistiques sur le campus.",
      "program": "Claire propose d'organiser des expositions d'art étudiant et des événements culturels pour enrichir la vie universitaire. Elle souhaite également introduire des ateliers créatifs pour stimuler l'expression artistique des étudiants."
    },
    {
      "id": "7",
      "name": "Maxime Lefrançois",
      "age": 24,
      "profilePictureUrl": "https://images.unsplash.com/photo-1510820710135-c04d3e3a69a3",
      "bio": "Maxime Lefrançois, étudiant en sciences sociales, a une grande expérience en gestion de projet communautaire et en animation de groupes.",
      "program": "Maxime souhaite développer des programmes de mentorat pour les nouveaux étudiants afin de faciliter leur intégration. Il propose aussi des sessions régulières pour discuter des préoccupations des étudiants et travailler sur des solutions collectives."
    },
    {
      "id": "8",
      "name": "Julie Moreau",
      "age": 22,
      "profilePictureUrl": "https://images.unsplash.com/photo-1506748686214-e9f0eeb2b16a",
      "bio": "Julie Moreau, étudiante en sciences de la vie, est une organisatrice passionnée et une défenseuse de la durabilité. Elle est impliquée dans plusieurs initiatives écologiques sur le campus.",
      "program": "Julie propose d’introduire des pratiques plus écologiques sur le campus, comme le recyclage et la réduction des déchets. Elle souhaite aussi organiser des événements de sensibilisation à l'environnement pour encourager des comportements durables."
    },
    {
      "id": "9",
      "name": "Thomas Roux",
      "age": 27,
      "profilePictureUrl": "https://images.unsplash.com/photo-1531543580192-46fd9c5875b2",
      "bio": "Thomas Roux, étudiant en architecture, est connu pour ses compétences en planification et en design. Il est également impliqué dans plusieurs projets de développement durable.",
      "program": "Thomas veut travailler sur la rénovation des espaces communs du campus et sur des projets de développement durable. Il propose également de créer des espaces de travail collaboratifs pour les étudiants."
    },
    {
      "id": "10",
      "name": "Emma Girard",
      "age": 24,
      "profilePictureUrl": "https://images.unsplash.com/photo-1506748686214-1c47d73e4a4b",
      "bio": "Emma Girard, en master de psychologie, est une passionnée de bien-être étudiant. Elle est impliquée dans des initiatives de soutien psychologique sur le campus.",
      "program": "Emma souhaite améliorer les services de soutien psychologique en créant des groupes de discussion et des ateliers de gestion du stress. Elle propose également des initiatives pour promouvoir la santé mentale et le bien-être général des étudiants."
    },
    {
      "id": "11",
      "name": "David Garcia",
      "age": 26,
      "profilePictureUrl": "https://images.unsplash.com/photo-1522045558723-e8c4f18a7c4a",
      "bio": "David Garcia, étudiant en informatique, est un expert en technologies et en développement de logiciels. Il est très engagé dans la communauté technologique de l'université.",
      "program": "David propose de mettre en place des ateliers de programmation et de développement pour les étudiants intéressés par la technologie. Il veut aussi améliorer les infrastructures informatiques du campus pour une meilleure connectivité."
    },
    {
      "id": "12",
      "name": "Léa Carpentier",
      "age": 23,
      "profilePictureUrl": "https://images.unsplash.com/photo-1506748686214-3838a5bfc833",
      "bio": "Léa Carpentier, étudiante en économie, est une leader naturelle avec une expérience en gestion de projets économiques. Elle est impliquée dans des initiatives pour améliorer les services financiers des étudiants.",
      "program": "Léa souhaite introduire des séances d'information sur la gestion financière personnelle et les opportunités de financement pour les projets étudiants. Elle propose également des initiatives pour améliorer l'accès aux ressources financières sur le campus."
    },
    {
      "id": "13",
      "name": "Alexandre Simon",
      "age": 25,
      "profilePictureUrl": "https://images.unsplash.com/photo-1532032211626-8b87d6dc6f8d",
      "bio": "Alexandre Simon, étudiant en relations internationales, est un passionné de diplomatie et de gestion des conflits. Il a travaillé sur plusieurs projets de médiation sur le campus.",
      "program": "Alexandre propose de créer un centre de médiation pour aider à résoudre les conflits entre étudiants et administration. Il souhaite également organiser des débats et des forums pour encourager la discussion constructive."
    },
    {
      "id": "14",
      "name": "Chloé Dupuis",
      "age": 24,
      "profilePictureUrl": "https://images.unsplash.com/photo-1527742407595-c11f93f8b123",
      "bio": "Chloé Dupuis, en licence de marketing, est connue pour ses compétences en communication et en gestion de campagnes. Elle a dirigé plusieurs campagnes de sensibilisation sur le campus.",
      "program": "Chloé veut améliorer la communication entre les étudiants et les différentes associations en introduisant un bulletin d'information mensuel. Elle propose également de créer des outils pour faciliter la gestion des campagnes et des événements étudiants."
    },
    {
      "id": "15",
      "name": "Jules Leroy",
      "age": 23,
      "profilePictureUrl": "https://images.unsplash.com/photo-1522800689000-74d8a183e3ad",
      "bio": "Jules Leroy, étudiant en mathématiques, est un analyste brillant avec un grand intérêt pour les statistiques et les données. Il a travaillé sur plusieurs projets d'analyse de données pour des organisations étudiantes.",
      "program": "Jules souhaite utiliser ses compétences en analyse de données pour améliorer la prise de décision sur le campus. Il propose de mettre en place des systèmes pour collecter et analyser les retours des étudiants sur différents services et initiatives."
    },
    {
      "id": "16",
      "name": "Zoé Pires",
      "age": 22,
      "profilePictureUrl": "https://images.unsplash.com/photo-1506748686214-7d6a8a92d295",
      "bio": "Zoé Pires, étudiante en design graphique, est une créative avec une passion pour le visuel et la communication. Elle a dirigé plusieurs projets de design pour des événements étudiants.",
      "program": "Zoé propose de créer une plateforme en ligne pour améliorer la visibilité des événements étudiants à travers des visuels attrayants. Elle souhaite également organiser des ateliers de design pour aider les étudiants à améliorer leurs compétences en communication visuelle."
    },
    {
      "id": "17",
      "name": "Nicolas Petit",
      "age": 26,
      "profilePictureUrl": "https://images.unsplash.com/photo-1555685816-79f88cdb7442",
      "bio": "Nicolas Petit, en master de biologie, est un passionné de recherche et d'innovation. Il est impliqué dans des projets de recherche sur le campus et souhaite encourager l'innovation.",
      "program": "Nicolas veut promouvoir la recherche et l'innovation sur le campus en introduisant des concours de projets de recherche et des bourses pour les meilleurs projets. Il souhaite également organiser des conférences pour partager les dernières avancées scientifiques avec la communauté universitaire."
    },
    {
      "id": "18",
      "name": "Elodie Roux",
      "age": 24,
      "profilePictureUrl": "https://images.unsplash.com/photo-1506748686214-4fa8a6347a2d",
      "bio": "Elodie Roux, étudiante en histoire, est passionnée par la culture et le patrimoine. Elle a participé à plusieurs projets de conservation culturelle sur le campus.",
      "program": "Elodie propose de créer des événements culturels pour célébrer la diversité et l'histoire sur le campus. Elle souhaite également mettre en place des visites guidées et des expositions pour mieux faire connaître le patrimoine culturel de la région."
    },
    {
      "id": "19",
      "name": "Julien Martin",
      "age": 25,
      "profilePictureUrl": "https://images.unsplash.com/photo-1519667437172-b3c1b8a8efc3",
      "bio": "Julien Martin, étudiant en physique, est un excellent communicateur avec une passion pour l'éducation scientifique. Il a dirigé plusieurs clubs de sciences et d'astronomie sur le campus.",
      "program": "Julien souhaite organiser des ateliers de vulgarisation scientifique pour rendre les sujets complexes plus accessibles aux étudiants. Il propose également des soirées d'observation astronomique et des conférences pour stimuler l'intérêt pour les sciences."
    },
    {
      "id": "20",
      "name": "Inès Lefebvre",
      "age": 22,
      "profilePictureUrl": "https://images.unsplash.com/photo-1506748686214-0c4c8cf82e35",
      "bio": "Inès Lefebvre, en licence de langues, est passionnée par les échanges culturels et linguistiques. Elle est impliquée dans plusieurs initiatives de partenariat avec des universités internationales.",
      "program": "Inès veut faciliter les échanges culturels et linguistiques en organisant des partenariats avec des universités à l'étranger. Elle propose également des événements pour promouvoir les langues et les cultures internationales au sein du campus."
    }
  ],
  "votes": [
    {
      "id": "8d2f",
      "userId": 1,
      "candidateId": 2,
      "voteTime": "2024-09-06T10:00:00Z",
      "qualities": "Le candidat est charismatique et a une bonne capacité d'écoute.",
      "program": 4,
      "representation": "Il a montré des compétences solides en leadership.",
      "profitable": "communication",
      "listening": 5
    },
    {
      "id": "8c2f",
      "userId": 2,
      "candidateId": 5,
      "voteTime": "2024-09-06T11:00:00Z",
      "qualities": "Son expérience dans le domaine est un atout majeur.",
      "program": 5,
      "representation": "Il est très engagé dans les projets de la communauté.",
      "profitable": "vote_en_ligne",
      "listening": 4
    },
    {
      "id": "913f",
      "userId": "ae7c",
      "candidateId": "2",
      "qualities": "Patient aimable",
      "program": "5",
      "representation": "Oui, c'est un bon leader",
      "profitable": "vote_en_ligne",
      "listening": "5",
      "voteTime": "2024-09-21T06:04:10.851Z"
    },
    {
      "id": "8766",
      "userId": "8a04",
      "candidateId": "2",
      "qualities": "Sage intelligent",
      "program": "5",
      "representation": "Parce que c'est mon frère",
      "profitable": "engagement_etudiants",
      "listening": "5",
      "voteTime": "2024-09-21T06:06:02.514Z"
    },
    {
      "id": "b442",
      "userId": "c632",
      "candidateId": "2",
      "qualities": "Calme et posé",
      "program": "3",
      "representation": "Oui il a tous les atouts",
      "profitable": "evenements_mensuels",
      "listening": "5",
      "voteTime": "2024-09-21T16:19:02.096Z"
    },
    {
      "id": "a96d",
      "userId": "3",
      "candidateId": "2",
      "qualities": "Pertinent et actif",
      "program": "5",
      "representation": "Oui oui programme detaillé",
      "profitable": "vote_en_ligne",
      "listening": "5",
      "voteTime": "2024-09-21T19:22:41.268Z"
    },
    {
      "id": "7ca4",
      "userId": "369d",
      "candidateId": "10",
      "qualities": "Admirable et patiente",
      "program": "5",
      "representation": "Oui oui oui je le crois",
      "profitable": "evenements_mensuels",
      "listening": "5",
      "voteTime": "2024-09-21T19:32:55.893Z"
    },
    {
      "id": "7687",
      "userId": "369d",
      "candidateId": "10",
      "qualities": "Admirable et patiente",
      "program": "5",
      "representation": "Oui oui oui je le crois",
      "profitable": "evenements_mensuels",
      "listening": "5",
      "voteTime": "2024-09-21T19:33:17.631Z"
    }
  ]
}